#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-tPYUkT9mwsMnD8QP

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
data.azurerm_client_config.current: Reading...
module.alerts.data.azurerm_subscription.current: Reading...
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
data.azuread_service_principal.current: Read complete after 1s [id=1debe752-d2ae-4e25-9c25-778e933e5fc0]
module.alerts.data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7]
module.secondary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet]
azurerm_postgresql_flexible_server.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql]
module.alerts.azurerm_monitor_action_group.alerts: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-roadmap-maker]
module.secondary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg]
module.primary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
module.alerts.azurerm_consumption_budget_subscription.budget: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/providers/Microsoft.Consumption/budgets/roadmap-maker-annual-budget]
module.secondary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.secondary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/app]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
azurerm_postgresql_flexible_server_firewall_rule.aks_subnet: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet]
azurerm_postgresql_flexible_server_active_directory_administrator.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_postgresql_flexible_server_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices]
azurerm_postgresql_flexible_server_database.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker]
module.secondary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.secondary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks]
module.primary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "southeastasia"
      + name                            = "shared-laworkspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "roadmap-maker-southeastasia-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.primary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks"
        name                                = "roadmap-maker-primary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "primary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "primary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "primary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "primary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

      + oms_agent {
          + log_analytics_workspace_id = (known after apply)
          + oms_agent_identity         = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.primary_monitoring.azurerm_monitor_diagnostic_setting.aks_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "roadmap-maker-primary-aks-diagnostics"
      + target_resource_id             = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks"

      + enabled_log {
          + category       = "cloud-controller-manager"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "cluster-autoscaler"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "guard"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-apiserver"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-audit"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-audit-admin"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-controller-manager"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-scheduler"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.primary_monitoring.azurerm_monitor_metric_alert.node_not_ready will be created
  + resource "azurerm_monitor_metric_alert" "node_not_ready" {
      + auto_mitigate            = true
      + description              = "Alert when a node is not ready"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "roadmap-maker-primary-aks-node-not-ready"
      + resource_group_name      = "roadmap-maker-southeastasia-rg"
      + scopes                   = [
          + "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks",
        ]
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Minimum"
          + metric_name            = "kube_node_status_condition"
          + metric_namespace       = "microsoft.containerservice/managedclusters"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 1

          + dimension {
              + name     = "condition"
              + operator = "Include"
              + values   = [
                  + "Ready",
                ]
            }
        }
    }

  # module.primary_network.azurerm_network_security_group.aks_nsg[0] will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg"
        name                = "roadmap-maker-primary-vnet-aks-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAKSInbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "AllowAKSOutbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "3000"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom3000Inbound"
              - priority                                   = 1010
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5173"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom5173Inbound"
              - priority                                   = 1030
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom80Inbound"
              - priority                                   = 1020
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKSInbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAKSOutbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (2 unchanged attributes hidden)
    }

  # module.secondary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks"
        name                                = "roadmap-maker-secondary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "secondary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "secondary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "secondary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "secondary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

      + oms_agent {
          + log_analytics_workspace_id = (known after apply)
          + oms_agent_identity         = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.secondary_network.azurerm_network_security_group.aks_nsg[0] will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg"
        name                = "roadmap-maker-secondary-vnet-aks-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAKSInbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "AllowAKSOutbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "3000"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom3000Inbound"
              - priority                                   = 1030
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5173"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom5173Inbound"
              - priority                                   = 1010
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom80Inbound"
              - priority                                   = 1020
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKSInbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAKSOutbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 0 to destroy.


```

</details>

*Pushed by: @Thanh8804, Action: `pull_request`*